Rechnerubung/Week7/Parameterstudien_mit_RANS/data/raw/AOA_10/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

#include "../system/globalVariables";

// //define turbulence intensity at inlet
// intensity	0.005; //Turbulence Intensity for External Flow and Airfoils are much below 1%
// mag_U_infty	15.62;

// //calculate k
// k_inlet		#calc "(3/2)*pow($mag_U_infty*$intensity,2)";

internalField   uniform $k_inlet;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        inletValue	$internalField;
    }
    outlet
    {
        type            inletOutlet;
	inletValue	$internalField;
    }
    suction_side
    {
        type            kLowReWallFunction;
        value           $internalField;
    }
    pressure_side
    {
        type            kLowReWallFunction;
        value           $internalField;
    }
    trailing_edge
    {
        type            kLowReWallFunction;
        value           $internalField;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
